---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ElectricalLoadType
source: html/b229dc94-8e25-6f6c-aeb7-8b141426c6ec.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalLoadType

Represents the electrical load type.

## Syntax (C#)
```csharp
public enum ElectricalLoadType
```